In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'dogs': [23, 17, 5, 12, 1, 5],
    'birds': [10, 7, 13, 2, 8, 19],
    'cats': [4, 14, 8, 15, 11, 3]}
data

{'birds': [10, 7, 13, 2, 8, 19],
 'cats': [4, 14, 8, 15, 11, 3],
 'dogs': [23, 17, 5, 12, 1, 5]}

In [3]:
shelter = pd.DataFrame(data)

In [4]:
shelter

   birds  cats  dogs
0     10     4    23
1      7    14    17
2     13     8     5
3      2    15    12
4      8    11     1
5     19     3     5

In [5]:
shelter.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
birds    6 non-null int64
cats     6 non-null int64
dogs     6 non-null int64
dtypes: int64(3)
memory usage: 224.0 bytes

In [6]:
idx_names = ['shelter0', 'shelter1', 'shelter2', 'shelter3', 'shelter4', 'shelter5']

In [7]:
shelter.index = idx_names

In [8]:
shelter.head(n = 10)

          birds  cats  dogs
shelter0     10     4    23
shelter1      7    14    17
shelter2     13     8     5
shelter3      2    15    12
shelter4      8    11     1
shelter5     19     3     5

In [9]:
shelter.loc['shelter2']

birds    13
cats      8
dogs      5
Name: shelter2, dtype: int64

In [10]:
shelter.iloc[3]

birds     2
cats     15
dogs     12
Name: shelter3, dtype: int64

In [11]:
shelter.loc["shelter0", "birds"]

10

In [12]:
shelter.loc[:,'birds']

shelter0    10
shelter1     7
shelter2    13
shelter3     2
shelter4     8
shelter5    19
Name: birds, dtype: int64

In [13]:
shelter.iloc[2:5]

          birds  cats  dogs
shelter2     13     8     5
shelter3      2    15    12
shelter4      8    11     1

In [14]:
shelter.iloc[2:5, 0:2]

          birds  cats
shelter2     13     8
shelter3      2    15
shelter4      8    11

In [15]:
shelter.birds

shelter0    10
shelter1     7
shelter2    13
shelter3     2
shelter4     8
shelter5    19
Name: birds, dtype: int64

In [16]:
shelter.columns

Index(['birds', 'cats', 'dogs'], dtype='object')

In [17]:
shelter.sort_values(by = 'cats')

          birds  cats  dogs
shelter5     19     3     5
shelter0     10     4    23
shelter2     13     8     5
shelter4      8    11     1
shelter1      7    14    17
shelter3      2    15    12

In [18]:
shelter.describe().T

       count       mean       std  min   25%  50%    75%   max
birds    6.0   9.833333  5.776389  2.0  7.25  9.0  12.25  19.0
cats     6.0   9.166667  5.036533  3.0  5.00  9.5  13.25  15.0
dogs     6.0  10.500000  8.384510  1.0  5.00  8.5  15.75  23.0

In [19]:
shelter.loc[:, 'dogs'] = shelter.loc[:, 'dogs'].apply(lambda x: x * 17)

In [20]:
shelter.loc[:, 'birds'] = shelter.loc[:, 'birds'].apply(lambda x: x * 8)

In [21]:
shelter.loc[:, 'cats'] = shelter.loc[:, 'cats'].apply(lambda x: x * 23)

In [22]:
shelter

          birds  cats  dogs
shelter0     80    92   391
shelter1     56   322   289
shelter2    104   184    85
shelter3     16   345   204
shelter4     64   253    17
shelter5    152    69    85

In [28]:
shelter = shelter.applymap(lambda x: x/2.0)

In [29]:
shelter

          birds   cats   dogs
shelter0   40.0   46.0  195.5
shelter1   28.0  161.0  144.5
shelter2   52.0   92.0   42.5
shelter3    8.0  172.5  102.0
shelter4   32.0  126.5    8.5
shelter5   76.0   34.5   42.5

In [30]:
result_filter = shelter[shelter < 50]
result_filter

          birds  cats  dogs
shelter0   40.0  46.0   NaN
shelter1   28.0   NaN   NaN
shelter2    NaN   NaN  42.5
shelter3    8.0   NaN   NaN
shelter4   32.0   NaN   8.5
shelter5    NaN  34.5  42.5

In [34]:
result_filter.query('dogs > 30', inplace=True)

In [32]:
result_filter

          birds  cats  dogs
shelter0   40.0  46.0   NaN
shelter5    NaN  34.5  42.5

In [35]:
shelter.loc[:, "dogs"].sum()

535.5

In [36]:
shelter

          birds   cats   dogs
shelter0   40.0   46.0  195.5
shelter1   28.0  161.0  144.5
shelter2   52.0   92.0   42.5
shelter3    8.0  172.5  102.0
shelter4   32.0  126.5    8.5
shelter5   76.0   34.5   42.5

In [37]:
shelter.apply(np.sum, axis = 0)

birds    236.0
cats     632.5
dogs     535.5
dtype: float64

In [38]:
shelter.apply(np.sum, axis = 1)

shelter0    281.5
shelter1    333.5
shelter2    186.5
shelter3    282.5
shelter4    167.0
shelter5    153.0
dtype: float64

In [39]:
new_col = [True, True, False, True, False, False]

In [40]:
shelter.loc[:, "foster"]= new_col

In [41]:
shelter

          birds   cats   dogs  foster
shelter0   40.0   46.0  195.5    True
shelter1   28.0  161.0  144.5    True
shelter2   52.0   92.0   42.5   False
shelter3    8.0  172.5  102.0    True
shelter4   32.0  126.5    8.5   False
shelter5   76.0   34.5   42.5   False

In [42]:
shelter.groupby('foster').apply(np.sum)

        birds   cats   dogs  foster
foster
False   160.0  253.0   93.5     0.0
True     76.0  379.5  442.0     3.0